{
  "command_create": {
    "error": "Es gab einen Fehler beim Versuch, diesen Befehl auszuführen!"
  },
  "error": {
    "admin_only": "Du bist nicht berechtigt, diesen Befehl auszuführen!\nNur Bot-Admins können diesen Befehl ausführen.",
    "args_needed": "Dieser Befehl benötigt Argumente! Du hast aber keine abgegeben.",
    "args_min_length": "Dieser Befehl benötigt mindestens %0 Argumente! Du hast aber nur %1 abgegeben.",
    "args_max_length": "Diesem Befehl können maximal %0 Argumente übergeben werden! Du hast aber %1 abgegeben.",
    "cooldown": "Auf diesen Befehl gibt es einen Cooldown. Du musst noch `%0` warten, um den Befehl wieder ausführen zu können.",
    "missing_args_proper_use": "Die korrekte Verwendung wäre: `%0`!",
    "dm_only": "Ich kann diesen Befehl nur im privaten Chat mit dir ausführen!",
    "guild_only": "Ich kann diesen Befehl leider nur in Servern ausführen!",
    "need_permission": "Du bist nicht berechtigt, diesen Befehl auszuführen!\nDu benötigst folgende Rechte um diesen Befehl auszuführen: %0",
    "nsfw": "Diesen Befehl kannst du leider nur in NSFW-Kanälen ausführen!"
  },
  "mods_help": {
    "modifications": "Modifikationen",
    "admin_only": "Nur von Bot-Admins ausführbar",
    "args_needed": "Benötigt Argumente",
    "args_max_length": "Maximale Anzahl an Argumenten: `%0`",
    "args_min_length": "Minimale Anzahl an Argumenten: `%0`",
    "cooldown": "Cooldown: `%0`",
    "cooldown_global": "Globaler-Cooldown: `%0`",
    "dm_only": "Nur in DMs ausführbar",
    "guild_only": "Nur in Servern ausführbar",
    "need_permission": "Benötigt folgende Rechte: `%0`",
    "nsfw": "Nur in NSFW-Channeln ausführbar"
  },
  "commands": {
    "echo": {
      "help": "Sendet die übergebenen Argumente zurück.",
      "usage": "[Text]"
    },
    "help": {
      "help": "Ohne Argumente listet dieser Befehl alle ausführbaren Befehle auf. Falls ein Befehl als Argument übergeben wird, werden Informationen zu diesem Befehl zurückgegeben.",
      "usage": "[Name eines Befehls]",
      "invalid_command": "Das ist kein gültiger Befehl!",
      "command": "Kommando",
      "back_to_message": "Zurück zur Nachricht",
      "jump_to_dm": "Springe zur DM",
      "intro": "Liste mit allen Befehlen:\n%0\nDu kannst %1 senden, um Informationen zu einem bestimmten Befehl zu erhalten!",
      "dm": {
        "success": "Dir wurde eine DM geschickt!",
        "fail_console": "Es konnte keine DM senden an %0",
        "fail_reply": "Es scheint so, als ob ich dir keine DMs schicken kann! Hast du DMs deaktiviert?"
      },
      "success": {
        "name": "**Name:**",
        "aliases": "**Aliasse:**",
        "description": "**Beschreibung:**",
        "usage": "**Verwendung:**"
      },
      "menu": {
        "placeholder": "Wähle Befehle für weitere Details",
        "all_label": "Alle Kommandos",
        "all_description": "Liste mit allen Befehlen"
      }
    },
    "ping": {
      "help": "Rufe den Ping des Bots ab.",
      "websocket": "Websocket Heartbeat: %0ms",
      "pinging": "Senden...",
      "roundtrip": "Roundtrip Latenz: %0ms"
    },
    "reload": {
      "help": "Lädt einen Befehl erneut.",
      "usage": "[Name eines Befehls]",
      "invalid_command": "Es gibt keinen Befehl mit diesem Namen oder Alias %0!",
      "success": "%0 wurde neu geladen!",
      "fail": "Es gab einen Fehler beim Nachladen des Befehls %0:\n%1"
    },
    "lang": {
      "help": "Ohne Argumente gibt dieser Befehl deine aktuell gesetzte Sprache aus. Mit einem Argument setzt dieser Befehl deine Sprache auf die übergebende Sprache, sofern diese existiert.\nUnterstütze Sprachen: ",
      "usage": "[Sprache]",
      "invalid": "Diese Sprache existiert nicht!",
      "set": "Deine Sprache wurde gesetzt auf: %0",
      "get": "Deine aktuelle Sprache ist: %0",
      "error": "Error, ich konnte deine Sprache nicht ändern (%0)!"
    },
    "prefix": {
      "help": "Ohne Argumente gibt dieser Befehl den aktuellen Prefix des aus. Mit einem Argument setzt dieser Befehl den Prefix des Servers auf den Übergebenen",
      "usage": "[Prefix]",
      "too_long": "Der übergebene Prefix ist zu lang!",
      "get": "Der Prefix dieses Servers ist: %0",
      "set": "Der Prefix dieses Server wurde gesetzt auf: %0"
    },
    "info": {
      "help": "Zeigt nützliche Infos über die Servereinstellungen und darüber hinaus",
      "embed": {
        "title": "Infos",
        "general": {
          "name": "Allgemeine Infos",
          "servers": "Ich bin auf **%0** Servern!",
          "users": "Schon **%0** Benutzer haben mit mir interagiert!"
        },
        "server": {
          "name": "Server Infos",
          "prefix": "Prefix des Servers: `%0`",
          "mensa_enabled": "Die Mensa-Updates sind **aktiviert**\n%0",
          "mensa_disabled": "Die Mensa-Updates sind **deaktiviert**",
          "mensa_channel_id": "Mensa-Update-Channel: <#%0>",
          "bday_enabled": "Die Geburtstags-Updates sind **aktiviert**\n%0",
          "bday_disabled": "Die Geburtstags-Updates sind **deaktiviert**",
          "bday_channel_id": "Geburtstags-Update-Channel: <#%0>"
        }
      }
    },
    "poll": {
      "help": "Erstelle eine Umfrage im schönen Embed-Stil. Passend dazu werden automatisch Reaktionen erzeugt, mit denen andere dann abstimmten können.\nTipp: Du kannst Wörter in \"\" schreiben, dann zählt es als ein Argument (statt dem Leerzeichen) (z.B. \"Ich bin der Titel\")",
      "usage": "[Title] [Option1] [Option2] ...",
      "options": "Optionen",
      "embed_footer": "Umfrage-Id: %0",
      "success_add": "Erfolgreich Stimme hinzugefügt!\n[Link zur Umfrage](%0)",
      "success_remove": "Erfolgreich Stimme entfernt!\n[Link zur Umfrage](%0)"
    },
    "poll_private": {
      "help": "Erstelle eine private Umfrage im schönen Embed-Stil. Abstimmen kann man dann nicht mehr mit Reaktionen sondern nur mithilfe des poll_vote-Befehls aus den DMs\nTipp: Du kannst Wörter in \"\" schreiben, dann zählt es als ein Argument (statt dem Leerzeichen) (z.B. \"Ich bin der Titel\")",
      "usage": "[Title] [Option1] [Option2] ...",
      "score": "Ergebnis",
      "embed_footer": "Dies ist eine private Umfrage. Benutze %0poll_vote im privaten Chat mit diesem Bot oder die Buttons um abzustimmen!\nMit poll_unvote oder wiederholtem Drücken auf einen Button kannst du deine Stimme entfernen\nUmfrage-Id: %1"
    },
    "poll_edit": {
      "help": "Bearbeite eine Umfrage (egal welcher Art), indem du einfach nochmal den Titel und die Optionen übergibst.\nBeachte jedoch, dass nur der Author einer Umfrage oder der Server-Admin Umfragen bearbeiten können und dass die Ergebnisse nicht neu generiert werden (falls mehr/weniger Optionen angegeben werden).\nTipp: Du kannst Wörter in \"\" schreiben, dann zählt es als ein Argument (statt dem Leerzeichen) (z.B. \"Ich bin der Titel\")",
      "usage": "[Title] [Option1] [Option2] ...",
      "fail": {
        "guild": "Du musst diesen Befehl auf dem Server ausführen auf dem sich die Umfrage befindet!",
        "authorised": "Du bist nicht berechtigt, diese Umfrage zu bearbeiten.\nNur der Author einer Umfrage oder der Server-Admin darf eine Umfrage bearbeiten!"
      }
    },
    "poll_vote": {
      "help": "Stimme für private Umfragen ab. Übergebe dafür zunächst die Id-Nummer der Poll und dann den Buchstaben, für den du Stimmen willst.\nDu kannst für jede Option maximal einmal Stimmen!",
      "usage": "[poll_id] [Options_Buchstabe]",
      "success": "Erfolg!",
      "fail": {
        "poll_id": "Die Umfrage mit übergebener Id-Nummer existiert nicht!",
        "guild": "Du musst dem Server beigetreten sein, auf dem diese Umfrage existiert!",
        "not_private": "Du kannst diesen Befehl nur für private Umfragen benutzen!",
        "access": "Error: Ich kann die Umfragen-Nachricht nicht erreichen!",
        "choice": "Der das zweite Argument muss ein Buchstabe zwischen a bis z sein!",
        "choice_out_of_bounce": "Du musst eine Option wählen, die auch existiert!",
        "voted": "Du hast bereits für diese Option abgestimmt!",
        "not_voted": "Du hast noch nicht für diese Option abgestimmt!"
      }
    },
    "poll_unvote": {
      "help": "Entferne deine bereits abgegebene Stimme für private Umfragen. Übergebe dafür zunächst die Id-Nummer der Poll und dann den Buchstaben, bei dem du deine Stimme entfernen willst.",
      "usage": "[poll_id] [Options_Buchstabe]"
    },
    "mensa_set_channel": {
      "help": "Setzte den Kanal, in dem du Mensa-Updates erhalten möchtest.\nDer angegebene Kanal muss dabei in diesem Server liegen!",
      "usage": "[Kanal-Id]",
      "success": "Der Kanal wurde erfolgreich gesetzt!",
      "fail": {
        "no_number": "Das übergebene Argument ist keine Zahl!",
        "wrong_id": "Die übergebene Kanal-Id entspricht keinem Kanal auf diesem Server!"
      }
    },
    "mensa_enable": {
      "help": "Aktiviere die Mensa-Updates.\nBeachte dabei, dass der Mensa-Kanal mithilfe des Befehls `mensa_set_channel` gesetzt sein muss!",
      "success": "Die Mensa-Updates wurden erfolgreich aktiviert!",
      "fail": {
        "channel_not_set": "Der Mensa-Update-Kanal wurde noch nicht gesetzt!\nBenutzte dafür bitte den Befehl `mensa_set_channel`!"
      }
    },
    "mensa_disable": {
      "help": "Deaktiviere die Mensa-Updates.",
      "success": "Die Mensa-Updates wurden erfolgreich deaktiviert!"
    },
    "bday": {
      "help": "Zeigt dir Interessantes zu deinem Geburtstag oder Geburtstagen der Server-Mitglieder. Gib kein Argument an für nur deinen Geburtstag oder eine user_ids für einen bestimmten Benutzer!",
      "usage": "[user_id] oder [@User]",
      "success": "<@!%0> hat am **%1** Geburtstag und ist **%2** Jahre alt!",
      "fail": {
        "wrong_format": "Dein Argument hat das falsche Format!",
        "unknown_user": "Dieser User ist nicht auf diesem Server!",
        "user_opt_out": "Dieser User ist nicht opt in!"
      },
      "embed": {
        "title": "Bday Infos",
        "fields": {
          "general": "Allgemeines",
          "zodiac": "Sternzeichen: %0",
          "time_calcs": {
            "title": "Zeitrechnungen",
            "value": "<@!%0> lebt schon:\n%1",
            "days": "`%0d`",
            "h": "`%0h`",
            "ms": "`%0ms`",
            "or": " bzw.\n"
          }
        }
      },
      "zodiac": {
        "signs": {
          "Aries": "Widder",
          "Taurus": "Stier",
          "Gemini": "Zwillinge",
          "Cancer": "Krebs",
          "Leo": "Löwe",
          "Virgo": "Jungfrau",
          "Libra": "Waage",
          "Scorpio": "Skorpion",
          "Sagittarius": "Schütze",
          "Capricorn": "Steinbock",
          "Aquarius": "Wassermann",
          "Pisces": "Fische"
        },
        "sign_descriptions": {
          "Aries": "Der Widder ist voller Energie und verdankt diese durch seine impulsive, spontane und zeitweise etwas vorschnelle Natur.",
          "Taurus": "Der Stier ist ein sehr bodenständiges Sternzeichen, das für seine Zuverlässigkeit bekannt ist. Stiere gehören zu den geduldigsten Sternzeichen, doch sieht er sich in seiner Gutmütigkeit ausgenutzt oder seine Art zu leben bedroht, kann er auch sehr ungemütlich werden.",
          "Gemini": "Zwillinge sind zumeist sehr lebhafte Menschen, die an den unterschiedlichsten Themenbereichen interessiert sind. Trotz ihrer geistigen Beweglichkeit wird ihnen eine gewisse Oberflächlichkeit nachgesagt. Diese angebliche Oberflächlichkeit ist aber nur der Tatsache geschuldet, dass ihr schier unerschöpflicher Antrieb sie dazu bringt, immer neue Dinge erforschen zu wollen.",
          "Cancer": "Der Krebs ist ein toller Gesprächspartner und Zuhörer. Er spendet Trost und hat immer einen hilfreichen Tipp parat. In kritischen Situationen wirkt der Krebs sehr stark, doch er hat auch seine schwache Seite. Krebse nehmen sich vieles zu Herzen und können nur schwer verzeihen. Selbst nach einer Versöhnung werden die Ereignisse der Vergangenheit nicht vergessen. Nach einer Auseinandersetzung braucht der Krebs sehr viel Liebe, Zuspruch und Bestätigung.",
          "Leo": "Einen Löwen übersieht so schnell niemand. Egal welchen Raum er betritt, er zieht automatisch die Aufmerksamkeit auf sich. Manchmal ist dieser glanzvolle Auftritt auch beabsichtigt. Menschen mit dem Sternzeichen Löwen haben in der Regel viele Freunde, die sich von ihrem sonnigen Gemüt anstecken lassen und sich in ihrer Popularität sonnen.",
          "Virgo": "Jungfrauen haben ihre Ziele fest im Blick und sich bereits mehrere Strategien zurecht gelegt, mit denen sie diese Ziele erreichen können. Sie sind häufig beruflich sehr erfolgreich und haben auch ihr Privatleben fest im Griff. Wer mit einem Jungfrau-Geborenen verabredet ist, der wird niemals eine halbe Stunde auf seine Verabredung warten müssen. Denn Jungfrauen sind fast immer pünktlich und stets gut organisiert.",
          "Libra": "Waage-Geborene mögen keine Konflikte und sind stets um Ausgewogenheit bedacht. Das bedeutet im Umkehrschluss jedoch auch, dass Waagen nur schlecht Nein sagen können und so immer wieder in Situationen geraten, in denen sie sich sehr unwohl fühlen. Waagen rufen durch ihr teils uneindeutiges Verhalten Missverständnisse hervor, durch die sie ihr Leben nur unnötig kompliziert machen.",
          "Scorpio": "Skorpion-Geborene möchten den Dingen auf den Grund gehen, sei es im beruflichen oder im privaten Bereich. Mit halb garen Antworten und Ergebnissen lassen sie sich nicht abspeisen. Sie möchten wissen, was hinter den Dingen steckt und sind zudem noch sehr ehrgeizig.",
          "Sagittarius": "Menschen mit diesem Sternzeichen sind freiheitsliebend, optimistisch und haben hohe Ideale. Schützen sind sehr ehrliche und offene Menschen, die mit ihrer Ehrlichkeit jedoch manchmal über das Ziel hinaus schießen. Da Schütze-Geborene kein Blatt vor den Mund nehmen, stoßen sie ihre Mitmenschen schon mal vor den Kopf.",
          "Capricorn": "Menschen mit dem Sternzeichen Steinbock sind sehr fleißig und drücken sich nie vor einer Herausforderung, so anspruchsvoll sie auch sein mag. Selbst wenn es viele Monate oder Jahre dauern sollte ihr Ziel zu erreichen, Steinböcke beißen sich durch. Steinböcke definieren sich durch ihre Aufgaben und dadurch, dass sie Problemlöser sind. Menschen mit diesem Sternzeichen scheuen sich nicht vor Verantwortung und arbeiten häufig in Führungspositionen.",
          "Aquarius": "Die in diesem Sternzeichen geborenen Personen sind äußerst ideenreich und haben einen wachen Verstand.",
          "Pisces": "Menschen mit diesem Sternzeichen sind im wahrsten Sinne des Wortes schwer zu fassen und versuchen Konfrontationen auszuweichen. Das liegt zum einen an ihrem großen Bedürfnis nach Harmonie und zum anderen an ihrem teils schwach ausgeprägten Selbstbewusstsein. Daher reagieren sie sehr empfindlich auf jede Form von Kritik. Wurden die Gefühle eines Fischs erst einmal verletzt, fassen sie nur schwer wieder Vertrauen."
        }
      }
    },
    "bday_next": {
      "help": "Gibt den nächsten Geburtstag aus!",
      "embed": {
        "description_pl": "<@!%0> hat in **%1** Tagen als nächstes Geburtstag und wird **%2** Jahre alt.\nDas Geburtsdatum ist der **%3**!",
        "description_sg": "<@!%0> hat **morgen** als nächstes Geburtstag und wird **%1** Jahre alt.\nDas Geburtsdatum ist der **%2**!"
      },
      "fail": {
        "nothing_found": "Ich konnte keinen nächsten Geburtstag finden!"
      }
    },
    "bday_all": {
      "help": "Gibt alle eingetragenen Geburtstage aus!",
      "embed": {
        "title": "Liste aller Geburtstage",
        "bday_entry": "%0 - <@!%1>"
      },
      "months": [
        "Januar",
        "Februar",
        "März",
        "April",
        "Mai",
        "Juni",
        "Juli",
        "August",
        "September",
        "Oktober",
        "November",
        "Dezember"
      ]
    },
    "bday_disable": {
      "help": "Deaktiviert die Geburtstags-Updates.",
      "success": "Die Geburtstags-Updates wurden erfolgreich deaktiviert!"
    },
    "bday_enable": {
      "help": "Aktiviert die Geburtstags-Updates.\nBeachte dabei, dass der Geburtstags-Kanal mithilfe des Befehls `bday_set_channel` gesetzt sein muss!",
      "success": "Die Geburtstags-Updates wurden erfolgreich aktiviert!",
      "fail": {
        "channel_not_set": "Der Geburtstags-Update-Kanal wurde noch nicht gesetzt!\nBenutzte dafür bitte den Befehl `bday_set_channel`!"
      }
    },
    "bday_opt_in": {
      "help": "Opt in die Geburtstagsliste. Wer opt in ist, willigt ein, dass andere Mitglieder dieses Servers Zugriff auf den Namen in Verbindung mit dem angegebenen Geburtsdatum erhalten. Zudem wird am Tag des Geburtstags (sofern vom Admin aktiviert und man noch Servermitglied) eine kleine Glückwunschs-Nachricht auf diesem Server verschickt.",
      "usage": "[DD.MM.YYYY]",
      "success": "Erfolg!",
      "fail": {
        "wrong_format": "Du hast das falsche Format für das Datum abgegeben!",
        "in_future": "Das angegebene Zeitformat muss in der Vergangenheit liegen!"
      }
    },
    "bday_opt_out": {
      "help": "Opt aus der Geburtstagsliste. Dein Geburtstag wird aus der Liste gelöscht und ist nicht mehr auffindbar. Es gibt auch keine Glückwunschs-Nachricht an deinem Geburtstag mehr!",
      "success": "Erfolg!",
      "fail": {
        "not_opt_in": "Du bist bereits opt out!"
      }
    },
    "bday_set_channel": {
      "help": "Setzte den Kanal, in dem du Geburtstags-Updates erhalten möchtest.\nDer angegebene Kanal muss dabei in diesem Server liegen!",
      "usage": "[Kanal-Id]",
      "success": "Der Kanal wurde erfolgreich gesetzt!",
      "fail": {
        "no_number": "Das übergebene Argument ist keine Zahl!",
        "wrong_id": "Die übergebene Kanal-Id entspricht keinem Kanal auf diesem Server!"
      }
    },
    "template": {
      "help": "",
      "usage": ""
    },
    "template_add": {
      "help": "Fügt ein neues Template hinzu. Falls du schon ein Template mit gleichem übergebenen Titel hast, wird dieser überschrieben!",
      "usage": "[Titel] [Wert]",
      "success": "Erfolg!",
      "fail": {
        "to_long": "Deine Argumente dürfen nicht länger als als 2000 Zeichen sein!"
      }
    },
    "template_remove": {
      "help": "Entfernt ein gespeichertes Template via Angabe eines gültigen Titels",
      "usage": "[Titel]"
    },
    "template_post": {
      "help": "",
      "usage": ""
    }
  }
}
