{
  "command_create": {
    "error": "There was an error trying to execute that command!"
  },
  "error": {
    "args_needed": "This command needs arguments! But you didn't submit any.",
    "args_min_length": "This command takes at least %0 arguments! But you only submitted %1.",
    "args_max_length": "This command can only be passed with a maximum of %0 arguments! But you have submitted %1.",
    "cooldown": "There is a cooldown on this command. You have to wait another `%0` to be able to execute the command again.",
    "missing_args_proper_use": "The correct usage would be: `%0`!",
    "guild_only": "Sorry, I can only run this command in servers!",
    "dm_only": "I can only run this command in private chat with you!",
    "need_permission": "You are not authorized to execute this command!\nYou need the following permissions to execute this command: %0",
    "admin_only": "You are not authorized to execute this command!\nOnly bot admins can execute this command.",
    "nsfw": "Sorry, you can execute this command only in NSFW channels!"
  },
  "mods_help": {
    "modifications": "Modifications",
    "admin_only": "Only executable by bot admins",
    "args_needed": "Requires arguments",
    "args_max_length": "Maximum number of arguments: `%0`",
    "args_min_length": "Minimum number of arguments: `%0`",
    "cooldown": "Cooldown: `%0`",
    "cooldown_global": "Global Cooldown: `%0`",
    "dm_only": "Only executable in DMs",
    "guild_only": "Only executable in servers",
    "need_permission": "Requires the following permissions: `%0`",
    "nsfw": "Only executable in NSFW channels"
  },
  "commands": {
    "echo": {
      "help": "Sends back the passed arguments.",
      "usage": "[text]"
    },
    "help": {
      "help": "Without arguments, this command lists all executable commands. If a command is passed as argument, information about this command will returned.",
      "usage": "[command name]",
      "invalid_command": "That's not a valid command!",
      "command": "Command",
      "back_to_message": "Back to message",
      "jump_to_dm": "Jump to DM",
      "intro": "List with all commands:\n%0\nYou can send %1 to get information about a specific command!",
      "dm": {
        "success": "I've sent you a DM!",
        "fail_console": "Could not send help DM to %0",
        "fail_reply": "It seems like I can't DM you! Do you have DMs disabled?"
      },
      "success": {
        "name": "**Name:**",
        "aliases": "**Aliases:**",
        "description": "**Description:**",
        "usage": "**Usage:**"
      },
      "menu": {
        "placeholder": "Select commands for more detail",
        "all_label": "All Commands",
        "all_description": "List with all commands"
      }
    },
    "ping": {
      "help": "Get the bot's ping.",
      "websocket": "Websocket heartbeat: %0ms",
      "pinging": "Pinging...",
      "roundtrip": "Roundtrip latency: %0ms"
    },
    "reload": {
      "help": "Reloads a command",
      "usage": "[command name]",
      "invalid_command": "There is no command with this name or alias %0!",
      "success": "%0 was reloaded!",
      "fail": "There was an error while reloading the command %0:\n%1"
    },
    "lang": {
      "help": "Without arguments, this command outputs your currently set language. With an argument, this command sets your language to the passing language, if it exists.\nSupported languages:",
      "usage": "[language]",
      "invalid": "This language is not supported!",
      "set": "Your language has been been set to: %0",
      "get": "Your current language is: %0",
      "error": "Error, I could not change your language (%0)!"
    },
    "prefix": {
      "help": "Without arguments, this command prints the current prefix of the guild. With an argument, this command sets the prefix of the guild to the given one",
      "usage": "[prefix]",
      "too_long": "The passed prefix is too long!",
      "get": "The prefix of this server is: %0",
      "set": "The prefix of this server has been set to: %0"
    },
    "info": {
      "help": "Shows useful infos about the server settings and beyond",
      "embed": {
        "title": {
          "info": "Infos",
          "general": {
            "name": "General Info",
            "servers": "I am on **%0** servers!",
            "users": "Already **%0** users have interacted with me!"
          },
          "server": {
          },
          "name": "Server Info",
          "prefix": "server prefix: `%0`",
          "mensa_enabled": "Mensa-Updates are **enabled**\n%0",
          "mensa_disabled": "Mensa-Updates are **disabled**",
          "mensa_channel_id": "Mensa-Update-Channel: <#%0>",
          "bday_enabled": "Birthday-Updates are **enabled**\n%0",
          "bday_disabled": "Birthday-Updates are **disabled**",
          "bday_channel_id": "Birthday-Updates-Channel: <#%0>"
        }
      }
    },
    "poll": {
      "help": "Create a poll in a beautiful embed style. Reactions are automatically generated so others can use them to vote.\nHint: You can write words in \"\", then it counts as one argument (instead of the space) (e.g. \"I am the title\")",
      "usage": "[Title] [Option1] [Option2] ...",
      "options": "Options",
      "embed_footer": "Poll-id: %0",
      "success_add": "Successfully added vote!\n[Link to survey](%0)",
      "success_remove": "Successfully removed vote!\n[Link to survey](%0)"
    },
    "poll_private": {
      "help": "Create a private poll in a nice embed style. You can then no longer vote with reactions but only with the help of the vote command from the DMs.\nHint: You can write words in \"\", then it counts as one argument (instead of the space) (e.g. \"I am the title\")",
      "usage": "[Title] [Option1] [Option2] ...",
      "score": "Score",
      "embed_footer": "This is a private poll. Use %0poll_vote in private chat (DMs) with this bot or the buttons to vote!\nYou can remove your vote with poll_unvote or by repeatedly pressing a button.\nPoll-Id: %1"
    },
    "poll_edit": {
      "help": "Edit a poll (of any type) by simply passing the title and options again.\nBut note that only the author of a poll or the server admin can edit polls and the reactions/scores will not be regenerated (if more/less options are given).\nHint: You can write words in \"\", then it counts as one argument (instead of the space) (e.g. \"I am the title\")",
      "usage": "[Title] [Option1] [Option2] ...",
      "fail": {
        "guild": "You must run this command on the server where the poll is located!",
        "authorised": "You are not authorised to edit this poll.\nOnly the author of a poll or the server admin is allowed to edit a poll!"
      }
    },
    "poll_vote": {
      "help": "Vote for private polls. To do so, first pass the poll id number and then the letter you want to vote for.\nYou can vote for each option a maximum of once!",
      "usage": "[poll_id] [option_letter]",
      "success": "Success!",
      "fail": {
        "poll_id": "The poll with passed id number does not exist!",
        "guild": "You must have joined the server where this poll exists!",
        "not_private": "You can only use this command for private polls!",
        "access": "Error: I can't access the poll message!",
        "choice": "The second argument must be a letter between a to z!",
        "choice_out_of_bounce": "You must choose an option that exists!",
        "voted": "You have already voted for this option!",
        "not_voted": "You have not yet voted for this option!"
      }
    },
    "poll_unvote": {
      "help": "Remove your vote for private polls. To do this, first pass the poll id number and then the letter where you want to remove your vote.",
      "usage": "[poll_id] [option_letter]"
    },
    "mensa_set_channel": {
      "help": "Set the channel in which you want to receive mensa updates.\nThe specified channel must be in this server!",
      "usage": "[channel id]",
      "success": "The channel was set successfully!",
      "fail": {
        "no_number": "The passed argument is not a number!",
        "wrong_id": "The passed channel id does not correspond to any channel on this server!"
      }
    },
    "mensa_enable": {
      "help": "Activate the mensa updates.\nNote that the mensa channel must be set by using the command `mensa_set_channel`!",
      "success": "Mensa updates have been successfully activated!",
      "fail": {
        "channel_not_set": "The mensa update channel has not been set yet!\nPlease use the command `mensa_set_channel` to set it!"
      }
    },
    "mensa_disable": {
      "help": "Disable the Mensa updates.",
      "success": "Mensa updates have been successfully disabled!"
    },
    "bday": {
      "help": "Shows you interesting things about your birthday or the birthdays of server members. Do not give an argument for only your birthday or a user_ids for a specific user!",
      "usage": "[user_id] oder [@User]",
      "success": "<@%0> has birthday on **%1** and he is **%2** years old!",
      "fail": {
        "wrong_format": "Your argument has the wrong format!",
        "unknown_user": "This user is not on this server!",
        "user_opt_out": "This user is not opt in!"
      },
      "embed": {
        "title": "Bday Infos",
        "fields": {
          "general": "General",
          "zodiac": "Zodiac-Sign: %0",
          "time_calcs": {
            "title": "Time-Calculations",
            "value": "<@%0> already lives:\n%1",
            "days": "`%0d`",
            "h": "`%0h`",
            "ms": "`%0ms`",
            "or": " or\n"
          }
        }
      },
      "zodiac": {
        "signs": {
          "Aries": "Aries",
          "Taurus": "Taurus",
          "Gemini": "Gemini",
          "Cancer": "Cancer",
          "Leo": "Leo",
          "Virgo": "Virgo",
          "Libra": "Libra",
          "Scorpio": "Scorpio",
          "Sagittarius": "Sagittarius",
          "Capricorn": "Capricorn",
          "Aquarius": "Aquarius",
          "Pisces": "Pisces"
        },
        "sign_descriptions": {
          "Aries": "Aries is full of energy and owes this to its impulsive, spontaneous and at times somewhat rash nature.",
          "Taurus": "The Taurus is a very down-to-earth zodiac sign known for its reliability. Taurus is one of the most patient signs of the zodiac, but if he sees his good nature taken or his way of life threatened, he can also become very uncomfortable.",
          "Gemini": "Gemini are mostly very lively people who are interested in a wide variety of subjects. Despite their mental agility, they are said to be somewhat superficial. However, this alleged superficiality is only due to the fact that their sheer inexhaustible drive makes them want to explore new things all the time",
          "Cancer": "Cancer is a great conversationalist and listener. He gives comfort and always has a helpful tip ready. In critical situations, Cancer appears very strong, but it also has its weak side. Cancers take many things to heart and find it difficult to forgive. Even after a reconciliation, the events of the past are not forgotten. After a confrontation, the Cancer needs a lot of love, encouragement and confirmation.",
          "Leo": "No one is likely to overlook a lion. No matter which room he enters, he automatically attracts attention. Sometimes this glamorous appearance is also intentional. People with the zodiac sign Leo usually have many friends who are infected by their sunny disposition and bask in their popularity",
          "Virgo": "Virgos have their goals firmly in mind and already have several strategies in place to achieve them. They are often very successful professionally and also have their private life firmly under control. If you have a date with a Virgo-born person, you will never have to wait half an hour for your date. Because Virgos are almost always on time and always well organised.",
          "Libra": "Libra-born people do not like conflicts and are always concerned about balance. Conversely, however, this also means that Libra have difficulty saying no and thus repeatedly find themselves in situations in which they feel very uncomfortable. Libra's sometimes ambiguous behaviour causes misunderstandings, which only complicate their lives unnecessarily",
          "Scorpio": "Scorpio-born people want to get to the bottom of things, be it in the professional or private sphere. They won't be fobbed off with half-cooked answers and results. They want to know what is behind things and are also very ambitious",
          "Sagittarius": "People with this zodiac sign are freedom-loving, optimistic and have high ideals. Sagittarians are very honest and open people who sometimes overshoot the mark with their honesty. Since Sagittarians don't mince their words, they can sometimes offend those around them",
          "Capricorn": "People with the zodiac sign Capricorn are very hard-working and never shirk a challenge, no matter how demanding it may be. Even if it takes many months or years to reach their goal, Capricorns persevere. Capricorns define themselves by their tasks and by being problem solvers. People with this zodiac sign do not shy away from responsibility and often work in leadership positions.",
          "Aquarius": "Those born under this zodiac sign are extremely imaginative and have alert minds.",
          "Pisces": "People with this zodiac sign are literally elusive and try to avoid confrontation. This is due on the one hand to their great need for harmony and on the other hand to their sometimes weakly developed self-confidence. Therefore they react very sensitively to any form of criticism. Once a Pisces' feelings have been hurt, they find it difficult to regain trust."
        }
      }
    },
    "bday_next": {
      "help": "Outputs the next birthday!",
      "embed": {
        "description_pl": "<@%0> next birthday is in **%1** days and will be **%2** years old.\nThe date of birth is **%3**!",
        "description_sg": "<@%0> birthday is **tomorrow** next and will be **%1** years old.\nThe date of birth is **%2**!"
      },
      "fail": {
        "nothing_found": "I could not find a next birthday!"
      }
    },
    "bday_all": {
      "help": "Outputs all registered birthdays!",
      "embed": {
        "title": "List of all birthdays",
        "bday_entry": "%0 - <@%1>"
      },
      "months": [
        "January",
        "February",
        "March",
        "April",
        "May",
        "June",
        "July",
        "August",
        "September",
        "October",
        "November",
        "December"
      ]
    },
    "bday_disable": {
      "help": "Deactivate the birthday updates.",
      "success": "The birthday updates have been successfully deactivated!"
    },
    "bday_enable": {
      "help": "Activate the birthday updates.\nNote that the birthday channel must be set using the `bday_set_channel` command!",
      "success": "The birthday updates have been successfully activated!",
      "fail": {
        "channel_not_set": "The birthday update channel has not been set yet!\nPlease use the command `bday_set_channel` for this.!"
      }
    },
    "bday_opt_in": {
      "help": "Opt in to the birthday list. Whoever is opt in, agrees that other members of this server get access to the name in connection with the given date of birth. In addition, on the day of the birthday (if activated by the admin and you are still a server member) a small congratulatory message will be sent on this server.",
      "usage": "[DD.MM.YYYY]",
      "success": "Success!",
      "fail": {
        "wrong_format": "You have entered the wrong format for the date!",
        "in_future": "The specified time format must be in the past!"
      }
    },
    "bday_opt_out": {
      "help": "Opt out of the birthday list. Your birthday is deleted from the list and can no longer be found. There will also no longer be a congratulatory message on your birthday!",
      "success": "Success!",
      "fail": {
        "not_opt_in": "You are already opt out!"
      }
    },
    "bday_set_channel": {
      "help": "Set the channel in which you want to receive birthday updates.\nThe specified channel must be in this server.!",
      "usage": "[Channel-Id]",
      "success": "The channel was set successfully!",
      "fail": {
        "no_number": "The passed argument is not a number!",
        "wrong_id": "The transferred channel ID does not correspond to any channel on this server.!"
      }
    }
  }
}
